tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/rightSolid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            maxX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            rightSolid_to_heater
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName heater;
                neighbourPatchName heater_to_rightSolid;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;
            }
            rightSolid_to_bottomAir
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName bottomAir;
                neighbourPatchName bottomAir_to_rightSolid;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;
            }
            rightSolid_to_topAir
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName topAir;
                neighbourPatchName topAir_to_rightSolid;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;
            }
        }
    }

    rho
    {
        internalField   uniform 8000;

        boundaryField
        {
            maxX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            rightSolid_to_bottomAir
            {
                type            zeroGradient;
            }
            rightSolid_to_heater
            {
                type            zeroGradient;
            }
            rightSolid_to_topAir
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 80;

        boundaryField
        {
            maxX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            rightSolid_to_bottomAir
            {
                type            zeroGradient;
            }
            rightSolid_to_heater
            {
                type            zeroGradient;
            }
            rightSolid_to_topAir
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            maxX
            {
                type            zeroGradient;
            }
            minZ
            {
                type            zeroGradient;
            }
            maxZ
            {
                type            zeroGradient;
            }
            rightSolid_to_bottomAir
            {
                type            zeroGradient;
            }
            rightSolid_to_heater
            {
                type            zeroGradient;
            }
            rightSolid_to_topAir
            {
                type            zeroGradient;
            }
        }
    }
}

// ************************************************************************* //
